Revit 2027 API
BuiltInFailures.StructuralLoadFailures.CannotMirrorBoundaryCondition Property
 Can't mirror Boundary Conditions
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotMirrorBoundaryCondition { get; }
Public Shared ReadOnly Property CannotMirrorBoundaryCondition As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotMirrorBoundaryCondition {
	FailureDefinitionId^ get ();
}
static member CannotMirrorBoundaryCondition : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StructuralLoadFailures Class
Autodesk.Revit.DB Namespace